In [1]:
from datetime import datetime
import pandas as pd

In [2]:
data = {
    'date' : [
        '2019-05-01 19:47:05.069722', 
        '2019-05-02 17:47:05.069722', 
        '2019-05-02 19:47:05.069722',
        '2019-05-03 18:47:05.069722',
        '2019-05-03 19:47:05.069722',
    ],
    'spent' : [
        13, 
        13,
        11,
        15,
        10
    ]  
}

In [3]:
data

{'date': ['2019-05-01 19:47:05.069722',
  '2019-05-02 17:47:05.069722',
  '2019-05-02 19:47:05.069722',
  '2019-05-03 18:47:05.069722',
  '2019-05-03 19:47:05.069722'],
 'spent': [13, 13, 11, 15, 10]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

                         date  spent
0  2019-05-01 19:47:05.069722     13
1  2019-05-02 17:47:05.069722     13
2  2019-05-02 19:47:05.069722     11
3  2019-05-03 18:47:05.069722     15
4  2019-05-03 19:47:05.069722     10

In [6]:
# Convert to String date teo datetime and then to date
df['date'] = pd.to_datetime(df['date']).dt.date

In [7]:
df

         date  spent
0  2019-05-01     13
1  2019-05-02     13
2  2019-05-02     11
3  2019-05-03     15
4  2019-05-03     10

In [8]:
df.groupby('date').mean()

            spent
date
2019-05-01   13.0
2019-05-02   12.0
2019-05-03   12.5

In [9]:
# If you want to get only integers, use as type (or .round(0) since 0.17.0)
df.groupby('date').mean().astype(int)

            spent
date
2019-05-01     13
2019-05-02     12
2019-05-03     12